MindScienceSkills/fluid_dynamics/fluid_dynamics/hpc-openfoam/assets/templates/interfoam-minimal/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  11                                    |
|   \\  /    A nd           | Website:  https://openfoam.org                  |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType  laminar;

// For RAS turbulence in multiphase:
// simulationType  RAS;
// RAS
// {
//     RASModel        kEpsilon;
//     turbulence      on;
//     printCoeffs     on;
// }

// ************************************************************************* //
